#+OPTIONS: toc:nil num:nil

* Introduction

  The Common Lisp systems in this repository can be used to build a
  command line program that provides several tools for inspecting and
  manipulating distributed systems using the [[https://github.com/open-rsx][Robotics Service Bus]]
  middleware.

  *The full documentation for RSB can be found [[https://open-rsx.github.io/rsb-manual/][here]].*

* Dependencies

  At the moment, the code is not portable and can only be used with
  the [[http://sbcl.org][SBCL]] implementation of Common Lisp.

  The following systems are required:

  + [[https://github.com/open-rsx/rsb-cl][rsb]]
  + [[https://github.com/scymtym/cl-protobuf][cl-protobuf]] for sending [[https://developers.google.com/protocol-buffers/][Protocol Buffers]] data

  Other than that, all  dependencies should be available on [[https://www.quicklisp.org/beta/][Quicklisp]].

* TODO Building

  There is a CMake-based legacy build system, but it will be removed.

* Using

  After building the binary, it can be invoked with a sub-command to
  select the function to perform:

  #+BEGIN_SRC bash :results output :exports both
    rsb-tools 2>&1
  #+END_SRC

  #+RESULTS:
  #+begin_example
  Invoke this program as

       rsb-tools redump [FILENAME (compress|static)*]
    or rsb-tools info
    or rsb-tools logger
    or rsb-tools call
    or rsb-tools send
    or rsb-tools introspect
    or rsb-tools web
    or rsb-tools bridge
    or rsb-tools server

  (not rsb-tools).
  #+end_example

  For more information, see the full documentation mentioned [[*Introduction][above]].

* Contributing

  If you want to contribute to this project, please

  + Submit your intended changes as coherent pull requests.

  + Rebase onto the master branch and squash any fixups and
    corrections.

  + Make sure the unit tests pass.

* Acknowledgments

  The development of this software has been supported as follows:

  + The development of this software was supported by CoR-Lab,
    Research Institute for Cognition and Robotics Bielefeld
    University.

  + This work was supported by the Cluster of Excellence Cognitive
    Interaction Technology ‘CITEC’ (EXC 277) at Bielefeld University,
    which is funded by the German Research Foundation (DFG).
